#Спочатку вкажемо, що в нас Bash- скрипт
#!/bin/bash

#Загалом наш скрипт рахує кількість звичайних файлів у /etc, виключаючи 
#директорії та символічні посилання 

# Ініціалізуємо змінну для збереження кількості файлів
count=$(find /etc -type f | wc -l)

# find etc -type f - шукаємо звичайні файли (-type f) в каталозі /etc
# wc -l - рахуємо кількість рядків, тобто саме кількість знайдених файлів
# результат збергаємо в count  і  виводимо

# Виводимо результат
echo "Кількість звичайних файлів у / etc: $count"
