# Спочатку вкажемо, що в нас Bash- скрипт
#!/bin/bash

# Загалом наш скрипт рахує кількість звичайних файлів у /etc, виключаючи 
# директорії та символічні посилання 
# також додамо перевірку,щоб працював тільки при запуску від root

#робимо перевірку прав користувача
if [ "$(id -u)" -ne 0 ]; then
  echo "Цей скрипт потрібно запускати з правами root"
  echo "Спробуйте через: sudo $0"
  exit 1
fi

# Ініціалізуємо змінну для збереження кількості файлів
count=$(find /etc -type f | wc -l)

# id -u - повертає числовий ідентифікатор користувача 
# 0 - root, будь-яке інше- звичайний користувач 
# -ne 0 означає не довірнює 0 
# тобто загалом якщо користувач не root, 
# тоді виводиться повідомлення про помилку та рекомендацію, як правильно запустити скрипт
 
# find etc -type f - шукаємо звичайні файли (-type f) в каталозі /etc
# wc -l - рахуємо кількість рядків, тобто саме кількість знайдених файлів
# результат збергаємо в count  і  виводимо

# Виводимо результат
echo "Кількість звичайних файлів у / etc: $count"
